_posts/2013-03-01-Gibbs-energy-minimization-and-the-NIST-webbook.html
---
title: Gibbs energy minimization and the NIST webbook
date: 2013/03/01 13:11:58
updated: 2013/03/01 13:11:58
categories: thermodynamics, optimization
permalink: http://jkitchin.github.com/blog/2013-03-01-gibbs-energy-minimization-and-the-nist-webbook/index.html
---


<p>
<a href="http://matlab.cheme.cmu.edu/2011/12/25/gibbs-energy-minimization-and-the-nist-webbook/" >Matlab post</a>
In Post 1536 we used the NIST webbook to compute a temperature dependent Gibbs energy of reaction, and then used a reaction extent variable to compute the equilibrium concentrations of each species for the water gas shift reaction.
</p>

<p>
Today, we look at the direct minimization of the Gibbs free energy of the species, with no assumptions about stoichiometry of reactions. We only apply the constraint of conservation of atoms. We use the NIST Webbook to provide the data for the Gibbs energy of each species.
</p>

<p>
As a reminder we consider equilibrium between the species \(CO\), \(H_2O\), \(CO_2\) and \(H_2\), at 1000K, and 10 atm total pressure with an initial equimolar molar flow rate of \(CO\) and \(H_2O\).
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

T = 1000  <span style="color: #ff0000; font-weight: bold;"># K</span>
R = 8.314e-3 <span style="color: #ff0000; font-weight: bold;"># kJ/mol/K</span>

P = 10.0 <span style="color: #ff0000; font-weight: bold;"># atm, this is the total pressure in the reactor</span>
Po = 1.0 <span style="color: #ff0000; font-weight: bold;"># atm, this is the standard state pressure</span>
</pre>
</div>

<p>
We are going to store all the data and calculations in vectors, so we need to assign each position in the vector to a species. Here are the definitions we use in this work.
</p>

<pre class="example">
1  CO
2  H2O
3  CO2
4  H2
</pre>

<div class="org-src-container">

<pre class="src src-python">species = [<span style="color: #228b22;">'CO'</span>, <span style="color: #228b22;">'H2O'</span>, <span style="color: #228b22;">'CO2'</span>, <span style="color: #228b22;">'H2'</span>]

<span style="color: #ff0000; font-weight: bold;"># Heats of formation at 298.15 K</span>

Hf298 = [
    -110.53,  <span style="color: #ff0000; font-weight: bold;"># CO</span>
    -241.826, <span style="color: #ff0000; font-weight: bold;"># H2O</span>
    -393.51,  <span style="color: #ff0000; font-weight: bold;"># CO2</span>
       0.0]   <span style="color: #ff0000; font-weight: bold;"># H2</span>

<span style="color: #ff0000; font-weight: bold;"># Shomate parameters for each species</span>
<span style="color: #ff0000; font-weight: bold;">#           A          B           C          D          E            F          G       H</span>
WB = [[25.56759,  6.096130,     4.054656,  -2.671301,  0.131021, -118.0089, 227.3665,   -110.5271],  <span style="color: #ff0000; font-weight: bold;"># CO</span>
      [30.09200,  6.832514,     6.793435,  -2.534480,  0.082139, -250.8810, 223.3967,   -241.8264],  <span style="color: #ff0000; font-weight: bold;"># H2O</span>
      [24.99735,  55.18696,   -33.69137,    7.948387, -0.136638, -403.6075, 228.2431,   -393.5224],  <span style="color: #ff0000; font-weight: bold;"># CO2</span>
      [33.066178, -11.363417,  11.432816,  -2.772874, -0.158558, -9.980797, 172.707974,    0.0]]     <span style="color: #ff0000; font-weight: bold;"># H2</span>

WB = np.array(WB)

<span style="color: #ff0000; font-weight: bold;"># Shomate equations</span>
t = T/1000
T_H = np.array([t,  t**2 / 2.0, t**3 / 3.0, t**4 / 4.0, -1.0 / t, 1.0, 0.0, -1.0])
T_S = np.array([np.log(t), t,  t**2 / 2.0,  t**3 / 3.0, -1.0 / (2.0 * t**2), 0.0, 1.0, 0.0])

H = np.dot(WB, T_H)        <span style="color: #ff0000; font-weight: bold;"># (H - H_298.15) kJ/mol</span>
S = np.dot(WB, T_S/1000.0) <span style="color: #ff0000; font-weight: bold;"># absolute entropy kJ/mol/K</span>

Gjo = Hf298 + H - T*S      <span style="color: #ff0000; font-weight: bold;"># Gibbs energy of each component at 1000 K</span>
</pre>
</div>

<p>
Now, construct the Gibbs free energy function, accounting for the change in activity due to concentration changes (ideal mixing).
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">def</span> <span style="color: #8b2323;">func</span>(nj):
    nj = np.array(nj)
    Enj = np.sum(nj);
    Gj =  Gjo / (R * T) + np.log(nj / Enj * P / Po)
    <span style="color: #8b0000;">return</span> np.dot(nj, Gj)
</pre>
</div>

<p>
We impose the constraint that all atoms are conserved from the initial conditions to the equilibrium distribution of species. These constraints are in the form of \(A_{eq} n = b_{eq}\), where \(n\) is the vector of mole numbers for each species.
</p>

<div class="org-src-container">

<pre class="src src-python">Aeq = np.array([[ 1,    0,    1,    0],  <span style="color: #ff0000; font-weight: bold;"># C balance</span>
                [ 1,    1,    2,    0],  <span style="color: #ff0000; font-weight: bold;"># O balance</span>
                [ 0,    2,    0,    2]]) <span style="color: #ff0000; font-weight: bold;"># H balance</span>

<span style="color: #ff0000; font-weight: bold;"># equimolar feed of 1 mol H2O and 1 mol CO</span>
beq = np.array([1,  <span style="color: #ff0000; font-weight: bold;"># mol C fed</span>
                2,  <span style="color: #ff0000; font-weight: bold;"># mol O fed</span>
                2]) <span style="color: #ff0000; font-weight: bold;"># mol H fed</span>

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">ec1</span>(nj):
    <span style="color: #228b22;">'conservation of atoms constraint'</span>
    <span style="color: #8b0000;">return</span> np.dot(Aeq, nj) - beq
</pre>
</div>

<p>
Now we are ready to solve the problem. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fmin_slsqp

n0 = [0.5, 0.5, 0.5, 0.5]  <span style="color: #ff0000; font-weight: bold;"># initial guesses</span>
N = fmin_slsqp(func, n0, f_eqcons=ec1)
<span style="color: #8b0000;">print</span> N
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; Optimization terminated successfully.    (Exit mode 0)
            Current function value: -91.204832308
            Iterations: 2
            Function evaluations: 13
            Gradient evaluations: 2
[ 0.45502309  0.45502309  0.54497691  0.54497691]
</pre>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Compute mole fractions and partial pressures</h2>
<div class="outline-text-2" id="text-1">
<p>
The pressures here are in good agreement with the pressures found by other methods. The minor disagreement (in the third or fourth decimal place) is likely due to convergence tolerances in the different algorithms used.
</p>

<div class="org-src-container">

<pre class="src src-python">yj = N / np.sum(N)
Pj = yj * P

<span style="color: #8b0000;">for</span> s, y, p <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">zip</span>(species, yj, Pj):
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:10s}: {1:1.2f} {2:1.2f}'</span>.format(s, y, p)
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; ... ... CO        : 0.23 2.28
H2O       : 0.23 2.28
CO2       : 0.27 2.72
H2        : 0.27 2.72
</pre>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Computing equilibrium constants</h2>
<div class="outline-text-2" id="text-2">
<p>
We can compute the equilibrium constant for the reaction \(CO + H_2O \rightleftharpoons CO_2 + H_2\). Compared to the value of K = 1.44 we found at the end of Post 1536 , the agreement is excellent. Note, that to define an equilibrium constant it is necessary to specify a reaction, even though it is not necessary to even consider a reaction to obtain the equilibrium distribution of species!
</p>

<div class="org-src-container">

<pre class="src src-python">nuj = np.array([-1, -1, 1, 1])  <span style="color: #ff0000; font-weight: bold;"># stoichiometric coefficients of the reaction</span>
K = np.prod(yj**nuj)
<span style="color: #8b0000;">print</span> K
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; 1.43446295961
</pre>
</div>
</div>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/03/01/Gibbs-energy-minimization-and-the-NIST-webbook.org">org-mode source</a><p>